[{
        "ISBN": "978-0596805524",
        "Naslov": "JavaScript: The Definitive Guide: Activate Your Web Pages (Definitive Guides)",
        "Oblast": "Javascript",
        "Autor 1": "David Flanagan",
        "Jezik": "EN",
        "Godina izdanja": "2008",
        "Korice": "001.jpg",
        "Cena": "2500.00",
        "Opis": "Since 1996, JavaScript: The Definitive Guide has been the bible for JavaScript programmers—a programmer's guide and comprehensive reference to the core language and to the client side JavaScript APIs defined by web browsers. The 6th edition covers HTML5 and ECMAScript 5. Many chapters have been completely rewritten to bring them in line with today's best web development practices. New chapters in this edition document jQuery and server side JavaScript. It's recommended for experienced programmers who want to learn the programming language of the Web, and for current JavaScript programmers who want to master it."
    },
    {
        "ISBN": "978-1593279509",
        "Naslov": "Eloquent JavaScript, 3rd Edition: A Modern Introduction to Programming",
        "Oblast": "Javascript",
        "Autor 1": "Marijn Haverbeke",
        "Jezik": "EN",
        "Godina izdanja": "2018",
        "Korice": "002.jpg",
        "Cena": "1700.00",
        "Opis": "JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track."
    },
    {
        "ISBN": "978-1119366447",
        "Naslov": "Professional JavaScript for Web Developers",
        "Oblast": "Javascript",
        "Autor 1": "Matt Frisbie",
        "Jezik": "EN",
        "Godina izdanja": "2019",
        "Korice": "004.jpg",
        "Cena": "8000.00",
        "Opis": "Professional JavaScript for Web Developers is the essential guide to next-level JavaScript development. Written for intermediate-to-advanced programmers, this book jumps right into the technical details to help you clean up your code and become a more sophisticated JavaScript developer. From JavaScript-specific object-oriented programming and inheritance, to combining JavaScript with HTML and other markup languages, expert instruction walks you through the fundamentals and beyond. This new fourth edition has been updated to cover through ECMAScript 2019; new frameworks and libraries, new techniques, new APIs, and more are explained in detail for the professional developer, with a practical focus that helps you put your new skills to work on real-world projects.\r\n\r\nThe latest--and most dramatic--ES release is already being incorporated into JavaScript engines in major browsers; this, coupled with the rise in mobile web traffic increasing demand for responsive, dynamic web design, means that all web developers need to update their skills--and this book is your ideal resource for quick, relevant guidance."
    },
    {
        "ISBN": "978-0596517748",
        "Naslov": "JavaScript: The Good Parts",
        "Oblast": "Javascript",
        "Autor 1": "Douglas Crockford",
        "Jezik": "EN",
        "Godina izdanja": "2008",
        "Korice": "005.jpg",
        "Cena": "2500.00",
        "Opis": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole-a subset you can use to create truly extensible and efficient code. Considered the JavaScript expert by many people in the development community, author Douglas Crockford identifies the abundance of good ideas that make JavaScript an outstanding object-oriented programming language-ideas such as functions, loose typing, dynamic objects, and an expressive object literal notation. Unfortunately, these good ideas are mixed in with bad and downright awful ideas, like a programming model based on global variables. When Java applets failed, JavaScript became the language of the Web by default, making its popularity almost completely independent of its qualities as a programming language. In JavaScript: The Good Parts, Crockford finally digs through the steaming pile of good intentions and blunders to give you a detailed look at all the genuinely elegant parts of JavaScript, including: Syntax Objects Functions Inheritance Arrays Regular expressions Methods Style Beautiful features The real beauty? As you move ahead with the subset of JavaScript that this book presents, you'll also sidestep the need to unlearn all the bad parts. Of course, if you want to find out more about the bad parts and how to use them badly, simply consult any other JavaScript book. With JavaScript: The Good Parts, you'll discover a beautiful, elegant, lightweight and highly expressive language that lets you create effective code, whether you're managing object libraries or just trying to get Ajax to run fast. If you develop sites or applications for the Web, this book is an absolute must."
    },
    {
        "ISBN": "978-5551-56521",
        "Naslov": "Secrets of the JavaScript Ninja",
        "Oblast": "Javascript",
        "Autor 1": "John Resig ",
        "Autor 2": "Bear Bibeault",
        "Autor 3": "Bear Bibeault",
        "Jezik": "EN",
        "Godina izdanja": "2015",
        "Korice": "006.jpg",
        "Cena": "1512.00",
        "Opis": "More than ever, the web is a universal platform for all types of applications, and JavaScript is the language of the web. If you're serious about web development, it's not enough to be a decent JavaScript coder. You need to be ninja stealthy, efficient, and ready for anything. This audiobook shows you how.  Secrets of the JavaScript Ninja, Second Edition uses practical examples to clearly illustrate each core concept and technique. This completely revised edition shows you how to master key JavaScript concepts such as functions, closures, objects, prototypes, and promises. It covers APIs such as the DOM, events, and timers. You'll discover best practice techniques such as testing and cross-browser development, all taught from the perspective of skilled JavaScript practitioners.  "
    },
    {
        "ISBN": "978-0134685991",
        "Naslov": "Effective Java",
        "Oblast": "Java",
        "Autor 1": "Joshua Bloch",
        "Jezik": "EN",
        "Godina izdanja": "2018",
        "Korice": "007.jpg",
        "Cena": "4475.00",
        "Opis": "Java has changed dramatically since the previous edition of Effective Java was published shortly after the release of Java 6. This Jolt award-winning classic has now been thoroughly updated to take full advantage of the latest language and library features. The support in modern Java for multiple paradigms increases the need for specific best-practices advice, and this book delivers. As in previous editions, each chapter of Effective Java, Third Edition, consists of several “items,” each presented in the form of a short, stand-alone essay that provides specific advice, insight into Java platform subtleties, and updated code examples. The comprehensive descriptions and explanations for each item illuminate what to do, what not to do, and why."
    },
    {
        "ISBN": "978-1260440218",
        "Naslov": "Java: A Beginner's Guide, Eighth Edition",
        "Oblast": "Java",
        "Autor 1": "Herbert Schildt",
        "Jezik": "EN",
        "Godina izdanja": "2018",
        "Korice": "008.jpg",
        "Cena": "2145.00",
        "Opis": "Fully updated for Java Platform, Standard Edition 11 (Java SE 11), Java: A Beginner’s Guide, Eighth Edition gets you started programming in Java right away. Best-selling programming author Herb Schildt begins with the basics, such as how to create, compile, and run a Java program. He then moves on to the keywords, syntax, and constructs that form the core of the Java language. The book also covers some of Java’s more advanced features, including multithreaded programming, generics, lambda expressions, modules, and Swing. As an added bonus, an introduction to JShell, Java’s interactive programming tool, is included. Best of all, it’s written in the clear, crisp, uncompromising style that has made Schildt the choice of millions worldwide."
    },
    {
        "ISBN": "978-0596009205",
        "Naslov": "Head First Java",
        "Oblast": "Java",
        "Autor 1": "Kathy Sierra",
        "Autor 2": "Bert Bates",
        "Jezik": "EN",
        "Godina izdanja": "2005",
        "Korice": "009.jpg",
        "Cena": "5574.00",
        "Opis": "Learning a complex new language is no easy task especially when it s an object-oriented computer programming language like Java. You might think the problem is your brain. It seems to have a mind of its own, a mind that doesn't always want to take in the dry, technical stuff you're forced to study. The fact is your brain craves novelty. It's constantly searching, scanning, waiting for something unusual to happen. After all, that's the way it was built to help you stay alive. It takes all the routine, ordinary, dull stuff and filters it to the background so it won't interfere with your brain's real work--recording things that matter. How does your brain know what matters? It's like the creators of the Head First approach say, suppose you're out for a hike and a tiger jumps in front of you, what happens in your brain? Neurons fire. Emotions crank up. Chemicals surge. That's how your brain knows."
    },
    {
        "ISBN": "978-1118490396",
        "Naslov": "Excel 2013 Power Programming with VBA",
        "Oblast": "Excel VBA",
        "Autor 1": "John Walkenbach",
        "Jezik": "EN",
        "Godina izdanja": "2013",
        "Korice": "010.jpg",
        "Cena": "1157.00",
        "Opis": "The new Excel 2013 boasts updated features, enhanced power, and new capabilities. Naturally, that means John Walkenbach returns with a new edition of his bestselling VBA Programming book and covers all the methods and tools you need to know in order to program with Excel. With this comprehensive guide, \"Mr. Spreadsheet\" shows you how to maximize your Excel experience using professional spreadsheet application development tips from his own personal bookshelf.\r\n\r\nFeaturing a complete introduction to Visual Basic for Applications and fully updated for the latest features of Excel 2013, this essential reference includes an analysis of Excel application development and is packed with procedures, tips, and ideas for expanding Excel's capabilities with VBA."
    },
    {
        "ISBN": "978-1509306114",
        "Naslov": "Microsoft Excel 2019 VBA and Macros (Business Skills)",
        "Oblast": "Excel VBA",
        "Autor 1": "Bill Jelen",
        "Autor 2": "Tracy Syrstad",
        "Jezik": "EN",
        "Godina izdanja": "2019",
        "Korice": "011.jpg",
        "Cena": "1114.00",
        "Opis": "Renowned Excel experts Bill Jelen (MrExcel) and Tracy Syrstad explain how to build more powerful, reliable, and efficient Excel spreadsheets. Use this guide to automate virtually any routine Excel task: save yourself hours, days, maybe even weeks. Make Excel do things you thought were impossible, discover macro techniques you won’t find anywhere else, and create automated reports that are amazingly powerful. Bill Jelen and Tracy Syrstad help you instantly visualize information to make it actionable; capture data from anywhere, and use it anywhere; and automate the best new features in Excel 2019 and Excel in Office 365. You’ll find simple, step-by-step instructions, real-world case studies, and 50 workbooks packed with examples and complete, easy-to-adapt solutions."
    },
    {
        "ISBN": "978-0131103627",
        "Naslov": "C Programming Language",
        "Oblast": "C/C++",
        "Autor 1": "Brian W. Kernighan",
        "Autor 2": "Dennis M. Ritchie",
        "Jezik": "EN",
        "Godina izdanja": "1988",
        "Korice": "012.jpg",
        "Cena": "9584.00",
        "Opis": "The authors present the complete guide to ANSI standard C language programming. Written by the developers of C, this new version helps readers keep up with the finalized ANSI standard for C while showing how to take advantage of C's rich set of operators, economy of expression, improved control flow, and data structures. The 2/E has been completely rewritten with additional examples and problem sets to clarify the implementation of difficult language constructs. For years, C programmers have let K&R guide them to building well-structured and efficient programs."
    },
    {
        "ISBN": "978-0321563842",
        "Naslov": "The C++ Programming Language",
        "Oblast": "C/C++",
        "Autor 1": "Bjarne Stroustrup",
        "Jezik": "EN",
        "Godina izdanja": "2013",
        "Korice": "013.jpg",
        "Cena": "1125.00",
        "Opis": "This book features an enhanced, layflat binding, which allows the book to stay open more easily when placed on a flat surface. This special binding method—noticeable by a small space inside the spine—also increases durability. C++11 has arrived: thoroughly master it, with the definitive new guide from C++ creator Bjarne Stroustrup, C++ Programming Language, Fourth Edition! The brand-new edition of the worlds most trusted and widely read guide to C++, it has been comprehensively updated for the long-awaited C++11 standard. Extensively rewritten to present the C++11 language, standard library, and key design techniques as an integrated whole, Stroustrup thoroughly addresses changes that make C++11 feel like a whole new language, offering definitive guidance for leveraging its improvements in performance, reliability, and clarity. C++ programmers around the world recognize Bjarne Stoustrup as the go-to expert for the absolutely authoritative and exceptionally useful information they need to write outstanding C++ programs. Now, as C++11 compilers arrive and development organizations migrate to the new standard, they know exactly where to turn once more: Stoustrup C++ Programming Language, Fourth Edition."
    },
    {
        "ISBN": "978-0789757746",
        "Naslov": "C++ in One Hour a Day, Sams Teach Yourself",
        "Oblast": "C/C++",
        "Autor 1": "Siddhartha Rao",
        "Jezik": "EN",
        "Godina izdanja": "2017",
        "Korice": "014.jpg",
        "Cena": "1250.00",
        "Opis": "In just one hour a day, you’ll have all the skills you need to begin programming in C++. With this complete tutorial, you’ll quickly master the basics, and then move on to more advanced features and concepts. Completely updated for the C++14 standard, with a preview of C++17, this book presents the language from a practical point of view, helping you learn how to use C++ to create faster, simpler, and more efficient C++ applications."
    },
    {
        "ISBN": "978-1789343625",
        "Naslov": "Extreme C: Taking you to the limit in Concurrency, OOP, and the most advanced capabilities of C",
        "Oblast": "C/C++",
        "Autor 1": "Kamran Amini",
        "Jezik": "BG",
        "Godina izdanja": "2019",
        "Korice": "015.jpg",
        "Cena": "4336.00",
        "Opis": "There's a lot more to C than knowing the language syntax. The industry looks for developers with a rigorous, scientific understanding of the principles and practices. Extreme C will teach you to use C's advanced low-level power to write effective, efficient systems. This intensive, practical guide will help you become an expert C programmer. Building on your existing C knowledge, you will master preprocessor directives, macros, conditional compilation, pointers, and much more. You will gain new insight into algorithm design, functions, and structures. You will discover how C helps you squeeze maximum performance out of critical, resource-constrained applications. C still plays a critical role in 21st-century programming, remaining the core language for precision engineering, aviations, space research, and more. This book shows how C works with Unix, how to implement OO principles in C, and fully covers multi-processing."
    },
    {
        "ISBN": "978-111-22-336",
        "Naslov": "Java 9",
        "Oblast": "Java",
        "Autor 1": "Edward Lavieri",
        "Autor 2": "Peter Verhas",
        "Jezik": "SR",
        "Godina izdanja": "2018",
        "Korice": "016.jpg",
        "Cena": "1760.00",
        "Opis": "Java 9 i nove funkcije u njemu poboljšavaju Javu - jedan od jezika koji programeri najčešće koriste za izgradnju robusnih softverskih aplikacija. U Javi 9 je stavljen poseban naglasak na integraciju modularnosti pomoću alatke Jigsaw. Ova knjiga predstavlja jednostavno uputstvo za učenje Java 9 programskog jezika. Dati su pregled i objašnjenje novih funkcija koje su uvedene u jezik Java 9 i važnosti novih interfejsa API i poboljšanja. Neke od novih funkcija Jave 9 su inovativne, pa, ako ste iskusni programer, moći ćete, ukoliko ih naučite, da izradite ekonomičniju poslovnu aplikaciju. Date su nove praktične smernice za primenu novostečenog znanja u vezi sa Javom 9 i dodatne informacije o budućem razvoju Java platforme. Ova knjiga će vam pomoći da poboljšate produktivnost, tako što ćete vašu aplikaciju učiniti bržom. Kada naučite najbolje tehnike koja se koriste u Javi, moći ćete da rešavate programerske probleme u vašoj organizaciji."
    },
    {
        "ISBN": "978-255-665-84544",
        "Naslov": "HTML5 CSS3 I JAVA SCRIPT Intergrisane tehnologije za razvoj veb strana",
        "Oblast": "Javascript",
        "Autor 1": "Laura Lemai",
        "Autor 2": "Rejf Kolburn",
        "Autor 3": "Dženifer Kirnin",
        "Jezik": "SR",
        "Godina izdanja": "2016",
        "Korice": "017.jpg",
        "Cena": "2970.00",
        "Opis": "Potpuno izmenjen i ažuriran, sa primerima napisanim u skladu sa HTML5, CSS3 i savremenom praksom veb razvoja, ovaj jednostavan i korak-po-korak priručnik pomaže vam da brzo savladate osnove HTML-a i CCS-a, pre nego što pređete na naprednije teme, kao što su grafika, video i interakcija sa JavaScriptom. Samo jedan sat dnevno dovoljno je da naučite veštine potrebne za dizajniranje, kreiranje i održavanje veb sajta profesionalnog izgleda. Prethodno iskustvo nije potrebno. Prateći kratke, jednočasovne lekcije u ovoj knjizi, svako može naučiti osnove veb razvoja"
    },
    {
        "ISBN": "978-255-667-844",
        "Naslov": "Naučite Javascript",
        "Oblast": "Javascript",
        "Autor 1": "Kajl Simpson",
        "Jezik": "SR",
        "Godina izdanja": "2016",
        "Korice": "018.jpg",
        "Cena": "3200.00",
        "Opis": "Lako je naučiti delove JavaScripta, ali je znatno teže savladati ga potpuno – ili čak samo dovoljno – bez obzira na to da li ste početnik ili ga koristite već godinama. Knjiga Naučite JavaScript pomoći će vam da bolje razumete JavaScript – čak i one zapetljane delove jezika koje i mnogi iskusni JavaScript programeri izbegavaju. Prvi deo knjige obezbeđuje potrebnu osnovu čitaocima s ograničenim iskustvom u programiranju. Savladavanje osnovnih gradivnih blokova programa i osnovnih mehanizama JavaScripta, pripremiće vas za proučavanje drugih, detaljnijih delova knjige i postaviti na put ka stvarnom upoznavanju JavaScripta. Drugi deo vas vodi kroz opsege vidljivosti i ograde – dva ključna koncepta koja treba da savladate kako biste postali bolji i efikasniji JavaScript programer. Upoznaćete sve vrste opsega vidljivosti i otkriti kako se koriste ograde za sinhrone i asinhrone poslove, uključujući i izradu JavaScript biblioteka."
    },
    {
        "ISBN": "978-255-669-847",
        "Naslov": "Java 8 programiranje",
        "Oblast": "Java",
        "Autor 1": "Javov Fain",
        "Jezik": "SR",
        "Godina izdanja": "2015",
        "Korice": "019.jpg",
        "Cena": "2640.00",
        "Opis": "Java 8 programiranje, prevod drugog izdanja, je vaš potpuni vodič za početnike Java programskog jezika, sa lekcijama koje se mogu jednostavno pratiti i dodatnim vežbama koje pomažu da brzo počnete sa samostalnim radom.\r\n\r\nInstrukcije tipa „korak-po-korak“ vode vas kroz osnove objektno-orijentisanog programiranja, sintaksu, interfejse, i još mnogo toga, kako biste stekli veštine za razvoj igara, web aplikacija, mrežnih aplikacija i automata.\r\n\r\nOvo drugo izdanje je dopunjeno tako da obuhvata Java SE 8 i Java EE 7 verzije, a uključuje nove informacije o GUI osnovama, lambda izrazima, API interfejsima za tokove, WebSocket interfejsu i Gradle alatu."
    },
    {
        "ISBN": "978-255-669-545",
        "Naslov": "HTML5 CSS3 i Javascript",
        "Oblast": "Javascript",
        "Autor 1": "J.D. Gauchat",
        "Jezik": "SR",
        "Godina izdanja": "2014",
        "Korice": "020.jpg",
        "Cena": "2500.00",
        "Opis": "Knjiga postupno vodi čitaoca ka sticanju neophodnih znanja i savladavanju složenih tema iz specifikacije za jezik HTML5. Kada je pročitate, znaćete kako da strukturirate svoje HTML5 dokumente, kako da ih stilizujete koristeći CSS3 i kako da radite s najmoćnijim API-jima JavaScripta.\r\nOva knjiga nije uvod u HTML5 već kompletan priručnik iz kojeg ćete naučiti kako da napravite atraktivne veb lokacije i aplikacije od samog početka. U svakom poglavlju razmatraju se osnovni i složeni koncepti jezika HTML5, CSS3 i JavaScript. Infomacije su podržane korisnim i potpuno funkcionalnim primerima, koji i početnike i stručnjake vode kroz svaku pojedinačnu oznaku, stil i funkciju obuhvaćenu specifikacijama. U primerima se postupno uvode sve složenije teme, tako da svima budu pristupačne i razumljive."
    },
    {
        "ISBN": "978-255-669-559",
        "Naslov": "C++ za 21 dan",
        "Oblast": "C/C++",
        "Autor 1": "Jesse Liberty",
        "Jezik": "SR",
        "Godina izdanja": "2003",
        "Korice": "021.jpg",
        "Cena": "2640.00",
        "Opis": "Naučite C++ za 21 dan, predstavlja priručnik-vodič za učenje objektno-orijentisanog dizajniranja, programiranja i analize. Pomoću ove knjige steći ćete celovito znanje o svim baznim konceptima, uključujući programski tok, upravljanje memorijom, kompajliranje i debagovanje. Da biste lakše pamtili i učili, knjigu smo osmislili u formi radionice, podelivši je na 21 poglavlje, tj. na 21 dan. Koncepti su razloženi na poglavlja koja se lako savladavaju pomoću brojnih listinga koji ilustruju ne samo kod, već ukazuju kako da taj kod učinite još boljim. Ovo izdanje je kompletno revidirano, ažurirano i u skladu sa ANSI standardom."
    }
]